{
    "hello": "Hi there! How can I assist you today?",
    "hi": "Hello! How can I help you?",
    "how are you?": "I'm just a bot, but I'm doing great! How about you?",
    "what is your name?": "I'm your friendly chatbot!",
    "what can you do?": "I can answer your questions based on predefined responses. Try asking me something!",
    "who created you?": "I was created using Python and Streamlit!",
    "tell me a joke": "Why don’t skeletons fight each other? Because they don’t have the guts!",
    "what is the capital of france?": "The capital of France is Paris.",
    "who is the ceo of tesla?": "Elon Musk is the CEO of Tesla.",
    "what is 7+9?": "7+9 equals 16!",
    "how old are you?": "I exist in the digital world, so I don't age!",
    "what is python?": "Python is a high-level programming language used for web development, AI, data science, and more.",
    "who is the president of the usa?": "I'm not sure at the moment. You can check the latest news!",
    "what is ai?": "Artificial Intelligence (AI) is the simulation of human intelligence in machines that can learn and make decisions.",
    "can you sing?": "I wish I could, but I can tell you a song recommendation if you'd like!",
    "recommend a movie": "How about watching 'Inception'? It's a great sci-fi thriller!",
    "recommend a book": "You might enjoy 'Atomic Habits' by James Clear!",
    "who won the last world cup?": "I'm not sure right now. You can check the latest sports news!",
    "what's your favorite color?": "I like all colors, but blue is quite popular!",
    "do you like pizza?": "I can't eat, but I hear pizza is delicious!",
    "what is the meaning of life?": "The meaning of life is different for everyone. What do you think it is?",
    "bye": "Goodbye! Have a great day!",
    "goodbye": "Take care! See you soon!",
    "thank you": "You're welcome! Happy to help!",
    "thanks": "Anytime! Let me know if you need anything else.",
    "what's the weather like today?": "Sorry, I can't check the weather right now. You can check on your phone or a weather website.",
    "what time is it?": "I don't have access to the time, but you can check it on your device!",
    "how can I help you?": "You can ask me anything, and I'll try to help you with predefined answers.",
    "how do I make coffee?": "To make a basic coffee, just boil water, pour it over ground coffee, and let it brew for a few minutes.",
    "what is your favorite food?": "I don't eat food, but I hear spaghetti is a popular dish!",
    "how can I stay healthy?": "To stay healthy, eat nutritious food, stay active, and get enough sleep.",
    "how do I clean my room?": "Start by picking up any clutter, then vacuum or sweep the floor, and wipe down surfaces.",
    "what is a good habit to develop?": "A good habit to develop is reading every day or exercising regularly.",
    "how do I study better?": "Find a quiet space, break your study sessions into intervals, and focus on one topic at a time.",
    "what should I do if I feel stressed?": "Try deep breathing exercises, take breaks, and engage in activities you enjoy.",
    "can you help me with math?": "I can help with simple math! Just ask away.",
    "how do I make friends?": "Start by being yourself, showing interest in others, and being a good listener.",
    "what should I wear today?": "Check the weather and choose something comfortable. Layer up if it's cold!",
    "what is love?": "Love is a complex emotion, often defined as deep affection and care for someone or something.",
    "how do I improve my communication skills?": "Practice listening actively, maintain eye contact, and express yourself clearly and confidently.",
    "how do I write a resume?": "A resume should include your contact details, work experience, education, and skills. Keep it concise.",
    "how can I save money?": "Track your spending, set a budget, and try to cut down on unnecessary expenses.",
    "how do I get a job?": "Search for job opportunities online, tailor your resume to each job, and prepare for interviews.",
    "how do I make a good first impression?": "Be punctual, smile, dress appropriately, and be polite.",
    "how do I deal with failure?": "Learn from your mistakes, stay positive, and try again with a better approach.",
    "what is the best way to travel?": "It depends on where you're going! Air travel is fast for long distances, but trains and buses can be more scenic and economical.",
    "can you solve puzzles?": "I can help with logic puzzles or riddles. Ask me one!"
}
